app/controllers/friends_controller.rb

SELECT "friends".* FROM "friends" WHERE "friends"."user_id" = ?  [["user_id", 3]]
---
  def index
    @friends = Friend.all.where(user_id: current_user.id)

INSERT INTO "friends" ("first_name", "last_name", "email", "phone", "instagram", "created_at", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?)  [["first_name", ""], ["last_name", ""], ["email", ""], ["phone", ""], ["instagram", ""], ["created_at", "2022-07-04 17:54:18.912888"], ["updated_at", "2022-07-04 17:54:18.912888"], ["user_id", 2]]
---
  def create
    #@friend = Friend.new(friend_params)
    @friend = current_user.friends.build(friend_params)

    respond_to do |format|
      if @friend.save

UPDATE "friends" SET "phone" = ?, "updated_at" = ? WHERE "friends"."id" = ?  [["phone", "55 1194751-5550"], ["updated_at", "2022-07-04 17:55:07.769110"], ["id", 19]]
---
  def update
    respond_to do |format|
      if @friend.update(friend_params)